## 🏗️ Terraform Plan - `dev` Environment

### Workflow Status
| Step | Status |
|------|--------|
| 🖌️ Format | ⚠️ |
| ⚙️ Init | ✅ |
| ✅ Validate | ✅ |
| 📖 Plan | ✅ |
| 🔒 Security Scan | ✅ |

### Resource Changes
| Action | Count |
|--------|-------|
| 🟢 Create | 54 |
| 🟡 Update | 0 |
| 🔴 Delete | 0 |

<details>
<summary>📋 Show Full Plan</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.acr.azurerm_container_registry.main has been deleted
  - resource "azurerm_container_registry" "main" {
      - id                            = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.ContainerRegistry/registries/bankingdevacr" -> null
      - login_server                  = "bankingdevacr.azurecr.io" -> null
      - name                          = "bankingdevacr" -> null
        tags                          = {
            "CostCenter"  = "development"
            "CreatedDate" = "2026-01-02T01:27:15Z"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (15 unchanged attributes hidden)
    }

  # module.aks.azurerm_user_assigned_identity.aks has been deleted
  - resource "azurerm_user_assigned_identity" "aks" {
      - id                  = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/banking-dev-aks-identity" -> null
        name                = "banking-dev-aks-identity"
      - principal_id        = "687fbac0-b15b-4946-854c-057f27dd9e57" -> null
        tags                = {
            "CostCenter"  = "development"
            "CreatedDate" = "01/02/2026 01:27:15"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (4 unchanged attributes hidden)
    }

  # module.keyvault.azurerm_key_vault.main has been deleted
  - resource "azurerm_key_vault" "main" {
      - id                              = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.KeyVault/vaults/banking-dev-kv-ejchr9" -> null
      - name                            = "banking-dev-kv-ejchr9" -> null
        tags                            = {
            "CostCenter"  = "development"
            "CreatedDate" = "2026-01-02T01:27:15Z"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
      - tenant_id                       = "fdc5ebae-7028-4044-bde5-e0dfd654368b" -> null
      - vault_uri                       = "https://banking-dev-kv-ejchr9.vault.azure.net/" -> null
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.monitoring.azurerm_application_insights.main[0] has been deleted
  - resource "azurerm_application_insights" "main" {
      - connection_string                     = (sensitive value) -> null
      - id                                    = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Insights/components/banking-dev-ai" -> null
      - instrumentation_key                   = (sensitive value) -> null
        name                                  = "banking-dev-ai"
        tags                                  = {
            "CostCenter"  = "development"
            "CreatedDate" = "2026-01-02T01:27:15Z"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (14 unchanged attributes hidden)
    }

  # module.monitoring.azurerm_log_analytics_workspace.main has been deleted
  - resource "azurerm_log_analytics_workspace" "main" {
      - id                                      = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.OperationalInsights/workspaces/banking-dev-law" -> null
      - name                                    = "banking-dev-law" -> null
      - primary_shared_key                      = (sensitive value) -> null
      - secondary_shared_key                    = (sensitive value) -> null
        tags                                    = {
            "CostCenter"  = "development"
            "CreatedDate" = "2026-01-02T01:27:15Z"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (12 unchanged attributes hidden)
    }

  # module.monitoring.azurerm_monitor_action_group.critical has been deleted
  - resource "azurerm_monitor_action_group" "critical" {
      - id                  = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Insights/actionGroups/banking-dev-critical-ag" -> null
        name                = "banking-dev-critical-ag"
        tags                = {
            "CostCenter"  = "development"
            "CreatedDate" = "2026-01-02T01:27:15Z"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.monitoring.azurerm_monitor_action_group.warning has been deleted
  - resource "azurerm_monitor_action_group" "warning" {
      - id                  = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Insights/actionGroups/banking-dev-warning-ag" -> null
        name                = "banking-dev-warning-ag"
        tags                = {
            "CostCenter"  = "development"
            "CreatedDate" = "2026-01-02T01:27:15Z"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (4 unchanged attributes hidden)
    }

  # module.networking.azurerm_nat_gateway.main[0] has been deleted
  - resource "azurerm_nat_gateway" "main" {
      - id                      = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/natGateways/banking-dev-nat-gateway" -> null
        name                    = "banking-dev-nat-gateway"
        tags                    = {
            "CostCenter"  = "development"
            "CreatedDate" = "2026-01-02T01:27:15Z"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (6 unchanged attributes hidden)
    }

  # module.networking.azurerm_network_security_group.aks has been deleted
  - resource "azurerm_network_security_group" "aks" {
      - id                  = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/networkSecurityGroups/banking-dev-aks-nsg" -> null
      - name                = "banking-dev-aks-nsg" -> null
        tags                = {
            "CostCenter"  = "development"
            "CreatedDate" = "2026-01-02T01:27:15Z"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (3 unchanged attributes hidden)
    }

  # module.networking.azurerm_network_security_group.database has been deleted
  - resource "azurerm_network_security_group" "database" {
      - id                  = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/networkSecurityGroups/banking-dev-db-nsg" -> null
      - name                = "banking-dev-db-nsg" -> null
        tags                = {
            "CostCenter"  = "development"
            "CreatedDate" = "2026-01-02T01:27:15Z"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (3 unchanged attributes hidden)
    }

  # module.networking.azurerm_private_dns_zone.acr has been deleted
  - resource "azurerm_private_dns_zone" "acr" {
      - id                                                    = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io" -> null
      - name                                                  = "privatelink.azurecr.io" -> null
        tags                                                  = {
            "CostCenter"  = "development"
            "CreatedDate" = "2026-01-02T01:27:15Z"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.networking.azurerm_private_dns_zone.keyvault has been deleted
  - resource "azurerm_private_dns_zone" "keyvault" {
      - id                                                    = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net" -> null
      - name                                                  = "privatelink.vaultcore.azure.net" -> null
        tags                                                  = {
            "CostCenter"  = "development"
            "CreatedDate" = "2026-01-02T01:27:15Z"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.networking.azurerm_private_dns_zone.mysql has been deleted
  - resource "azurerm_private_dns_zone" "mysql" {
      - id                                                    = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.mysql.database.azure.com" -> null
      - name                                                  = "privatelink.mysql.database.azure.com" -> null
        tags                                                  = {
            "CostCenter"  = "development"
            "CreatedDate" = "2026-01-02T01:27:15Z"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.mysql has been deleted
  - resource "azurerm_private_dns_zone_virtual_network_link" "mysql" {
      - id                    = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.mysql.database.azure.com/virtualNetworkLinks/mysql-vnet-link" -> null
        name                  = "mysql-vnet-link"
        tags                  = {
            "CostCenter"  = "development"
            "CreatedDate" = "2026-01-02T01:27:15Z"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (4 unchanged attributes hidden)
    }

  # module.networking.azurerm_public_ip.nat[0] has been deleted
  - resource "azurerm_public_ip" "nat" {
      - id                      = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/publicIPAddresses/banking-dev-nat-pip" -> null
      - ip_address              = "48.194.84.5" -> null
        name                    = "banking-dev-nat-pip"
        tags                    = {
            "CostCenter"  = "development"
            "CreatedDate" = "2026-01-02T01:27:15Z"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (9 unchanged attributes hidden)
    }

  # module.networking.azurerm_subnet.aks has been deleted
  - resource "azurerm_subnet" "aks" {
      - id                                             = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet/subnets/banking-dev-aks-subnet" -> null
        name                                           = "banking-dev-aks-subnet"
        # (10 unchanged attributes hidden)
    }

  # module.networking.azurerm_subnet.application_gateway[0] has been deleted
  - resource "azurerm_subnet" "application_gateway" {
      - id                                             = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet/subnets/banking-dev-appgw-subnet" -> null
        name                                           = "banking-dev-appgw-subnet"
        # (9 unchanged attributes hidden)
    }

  # module.networking.azurerm_subnet.database has been deleted
  - resource "azurerm_subnet" "database" {
      - id                                             = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet/subnets/banking-dev-db-subnet" -> null
        name                                           = "banking-dev-db-subnet"
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.networking.azurerm_subnet.private_endpoints has been deleted
  - resource "azurerm_subnet" "private_endpoints" {
      - id                                             = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet/subnets/banking-dev-pe-subnet" -> null
        name                                           = "banking-dev-pe-subnet"
        # (9 unchanged attributes hidden)
    }

  # module.networking.azurerm_virtual_network.main has been deleted
  - resource "azurerm_virtual_network" "main" {
      - id                      = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet" -> null
      - name                    = "banking-dev-vnet" -> null
        tags                    = {
            "CostCenter"  = "development"
            "CreatedDate" = "2026-01-02T01:27:15Z"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (7 unchanged attributes hidden)
    }

  # module.resource_group.azurerm_resource_group.main has been deleted
  - resource "azurerm_resource_group" "main" {
      - id       = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-dev-rg" -> null
      - location = "eastus" -> null
      - name     = "banking-dev-rg" -> null
        tags     = {
            "CostCenter"  = "development"
            "CreatedDate" = "2026-01-02T01:27:15Z"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault_secret.mysql_admin_password will be created
  + resource "azurerm_key_vault_secret" "mysql_admin_password" {
      + content_type            = "password"
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "mysql-admin-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.mysql_connection_string will be created
  + resource "azurerm_key_vault_secret" "mysql_connection_string" {
      + content_type            = "connection-string"
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "mysql-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.acr.azurerm_container_registry.main will be created
  + resource "azurerm_container_registry" "main" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + anonymous_pull_enabled        = false
      + data_endpoint_enabled         = false
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "centralus"
      + login_server                  = (known after apply)
      + name                          = "bankingdevacr"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + quarantine_policy_enabled     = false
      + resource_group_name           = "banking-dev-rg"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + tags                          = (known after apply)
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # module.acr.azurerm_monitor_diagnostic_setting.acr[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "acr" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "bankingdevacr-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "ContainerRegistryLoginEvents"
        }
      + enabled_log {
          + category = "ContainerRegistryRepositoryEvents"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.aks.azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + automatic_channel_upgrade           = "stable"
      + azure_policy_enabled                = false
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "banking-dev"
      + fqdn                                = (known after apply)
      + http_application_routing_enabled    = false
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.32"
      + location                            = "centralus"
      + name                                = "banking-dev-aks"
      + node_resource_group                 = "banking-dev-aks-nodes-rg"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "banking-dev-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = (known after apply)
      + workload_identity_enabled           = true

      + auto_scaler_profile {
          + balance_similar_node_groups      = true
          + empty_bulk_delete_max            = "10"
          + expander                         = "least-waste"
          + max_graceful_termination_sec     = "600"
          + max_node_provisioning_time       = "15m"
          + max_unready_nodes                = 3
          + max_unready_percentage           = 45
          + new_pod_scale_up_delay           = "10s"
          + scale_down_delay_after_add       = "10m"
          + scale_down_delay_after_delete    = "10s"
          + scale_down_delay_after_failure   = "3m"
          + scale_down_unneeded              = "10m"
          + scale_down_unready               = "20m"
          + scale_down_utilization_threshold = "0.5"
          + scan_interval                    = "10s"
          + skip_nodes_with_local_storage    = false
          + skip_nodes_with_system_pods      = true
        }

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = []
          + azure_rbac_enabled     = true
          + managed                = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling          = true
          + kubelet_disk_type            = (known after apply)
          + max_count                    = 3
          + max_pods                     = 50
          + min_count                    = 1
          + name                         = "system"
          + node_count                   = 1
          + node_labels                  = {
              + "environment"   = "dev"
              + "nodepool-type" = "system"
            }
          + only_critical_addons_enabled = true
          + orchestrator_version         = (known after apply)
          + os_disk_size_gb              = 128
          + os_disk_type                 = "Managed"
          + os_sku                       = (known after apply)
          + scale_down_mode              = "Delete"
          + tags                         = (known after apply)
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_DC2ds_v3"
          + vnet_subnet_id               = (known after apply)
          + workload_runtime             = (known after apply)

          + upgrade_settings {
              + max_surge = "33%"
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "2m"
        }

      + maintenance_window {
          + allowed {
              + day   = "Sunday"
              + hours = [
                  + 0,
                  + 1,
                  + 2,
                  + 3,
                  + 4,
                  + 5,
                ]
            }
        }

      + microsoft_defender {
          + log_analytics_workspace_id = (known after apply)
        }

      + network_profile {
          + dns_service_ip          = "10.100.0.10"
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          + ip_versions             = (known after apply)
          + load_balancer_sku       = "standard"
          + network_data_plane      = (known after apply)
          + network_mode            = (known after apply)
          + network_plugin          = "azure"
          + network_policy          = "azure"
          + outbound_ip_address_ids = (known after apply)
          + outbound_ip_prefix_ids  = (known after apply)
          + outbound_type           = "loadBalancer"
          + pod_cidr                = (known after apply)
          + pod_cidrs               = (known after apply)
          + service_cidr            = "10.100.0.0/16"
          + service_cidrs           = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips      = (known after apply)
              + idle_timeout_in_minutes     = 30
              + managed_outbound_ip_count   = 1
              + managed_outbound_ipv6_count = (known after apply)
              + outbound_ports_allocated    = 0
            }
        }

      + oms_agent {
          + log_analytics_workspace_id      = (known after apply)
          + msi_auth_for_monitoring_enabled = true
          + oms_agent_identity              = (known after apply)
        }
    }

  # module.aks.azurerm_kubernetes_cluster_node_pool.user will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "user" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 5
      + max_pods              = 50
      + min_count             = 1
      + mode                  = "User"
      + name                  = "user"
      + node_count            = 1
      + node_labels           = {
          + "environment"   = "dev"
          + "nodepool-type" = "user"
          + "workload-type" = "general"
        }
      + node_taints           = []
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = 128
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = (known after apply)
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_DC2ds_v3"
      + vnet_subnet_id        = (known after apply)

      + upgrade_settings {
          + max_surge = "33%"
        }
    }

  # module.aks.azurerm_monitor_diagnostic_setting.aks[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "aks" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "banking-dev-aks-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "cluster-autoscaler"
        }
      + enabled_log {
          + category = "guard"
        }
      + enabled_log {
          + category = "kube-apiserver"
        }
      + enabled_log {
          + category = "kube-audit"
        }
      + enabled_log {
          + category = "kube-audit-admin"
        }
      + enabled_log {
          + category = "kube-controller-manager"
        }
      + enabled_log {
          + category = "kube-scheduler"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.aks.azurerm_role_assignment.aks_acr_pull[0] will be created
  + resource "azurerm_role_assignment" "aks_acr_pull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.azurerm_role_assignment.aks_network_contributor will be created
  + resource "azurerm_role_assignment" "aks_network_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.azurerm_user_assigned_identity.aks will be created
  + resource "azurerm_user_assigned_identity" "aks" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "centralus"
      + name                = "banking-dev-aks-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "banking-dev-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

  # module.keyvault.azurerm_key_vault.main will be created
  + resource "azurerm_key_vault" "main" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "centralus"
      + name                            = "banking-dev-kv-ejchr9"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = false
      + resource_group_name             = "banking-dev-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 7
      + tags                            = (known after apply)
      + tenant_id                       = "fdc5ebae-7028-4044-bde5-e0dfd654368b"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.keyvault.azurerm_monitor_diagnostic_setting.keyvault[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "keyvault" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "banking-dev-kv-ejchr9-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }
      + enabled_log {
          + category = "AzurePolicyEvaluationDetails"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.keyvault.azurerm_role_assignment.terraform_admin[0] will be created
  + resource "azurerm_role_assignment" "terraform_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9676d6b0-2054-4fde-823f-4d3be8e0a6ca"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.monitoring.azurerm_application_insights.main[0] will be created
  + resource "azurerm_application_insights" "main" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 10
      + daily_data_cap_notifications_disabled = false
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "centralus"
      + name                                  = "banking-dev-ai"
      + resource_group_name                   = "banking-dev-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = (known after apply)
      + workspace_id                          = (known after apply)
    }

  # module.monitoring.azurerm_log_analytics_solution.container_insights[0] will be created
  + resource "azurerm_log_analytics_solution" "container_insights" {
      + id                    = (known after apply)
      + location              = "centralus"
      + resource_group_name   = "banking-dev-rg"
      + solution_name         = "ContainerInsights"
      + workspace_name        = "banking-dev-law"
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ContainerInsights"
          + publisher = "Microsoft"
        }
    }

  # module.monitoring.azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "centralus"
      + name                            = "banking-dev-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "banking-dev-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = (known after apply)
      + workspace_id                    = (known after apply)
    }

  # module.monitoring.azurerm_monitor_action_group.critical will be created
  + resource "azurerm_monitor_action_group" "critical" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "banking-dev-critical-ag"
      + resource_group_name = "banking-dev-rg"
      + short_name          = "Critical"
      + tags                = (known after apply)
    }

  # module.monitoring.azurerm_monitor_action_group.warning will be created
  + resource "azurerm_monitor_action_group" "warning" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "banking-dev-warning-ag"
      + resource_group_name = "banking-dev-rg"
      + short_name          = "Warning"
      + tags                = (known after apply)
    }

  # module.monitoring.azurerm_monitor_scheduled_query_rules_alert_v2.container_restarts[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "container_restarts" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when containers are restarting frequently"
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "centralus"
      + name                                   = "banking-dev-container-restarts-alert"
      + resource_group_name                    = "banking-dev-rg"
      + scopes                                 = (known after apply)
      + severity                               = 2
      + tags                                   = (known after apply)
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                KubePodInventory
                | where TimeGenerated > ago(15m)
                | where PodRestartCount > 5
                | summarize RestartCount = sum(PodRestartCount) by Name, Namespace
                | where RestartCount > 10
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # module.monitoring.azurerm_monitor_scheduled_query_rules_alert_v2.error_logs[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "error_logs" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when there are many application errors"
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "centralus"
      + name                                   = "banking-dev-error-logs-alert"
      + resource_group_name                    = "banking-dev-rg"
      + scopes                                 = (known after apply)
      + severity                               = 2
      + tags                                   = (known after apply)
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AppExceptions
                | where TimeGenerated > ago(15m)
                | summarize ErrorCount = count() by AppRoleName
                | where ErrorCount > 50
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # module.mysql.azurerm_monitor_diagnostic_setting.mysql[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "mysql" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "banking-dev-mysql-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "MySqlAuditLogs"
        }
      + enabled_log {
          + category = "MySqlSlowLogs"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.mysql.azurerm_mysql_flexible_database.main["bankingdb"] will be created
  + resource "azurerm_mysql_flexible_database" "main" {
      + charset             = "utf8mb4"
      + collation           = "utf8mb4_unicode_ci"
      + id                  = (known after apply)
      + name                = "bankingdb"
      + resource_group_name = "banking-dev-rg"
      + server_name         = "banking-dev-mysql"
    }

  # module.mysql.azurerm_mysql_flexible_server.main will be created
  + resource "azurerm_mysql_flexible_server" "main" {
      + administrator_login           = "mysqladmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 7
      + delegated_subnet_id           = (known after apply)
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "centralus"
      + name                          = "banking-dev-mysql"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = (known after apply)
      + replica_capacity              = (known after apply)
      + replication_role              = (known after apply)
      + resource_group_name           = "banking-dev-rg"
      + sku_name                      = "B_Standard_B1ms"
      + tags                          = (known after apply)
      + version                       = "8.0.21"
      + zone                          = "3"

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 2
          + start_minute = 0
        }

      + storage {
          + auto_grow_enabled  = true
          + io_scaling_enabled = false
          + iops               = 360
          + size_gb            = 32
        }
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.audit_log[0] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "audit_log" {
      + id                  = (known after apply)
      + name                = "audit_log_enabled"
      + resource_group_name = "banking-dev-rg"
      + server_name         = "banking-dev-mysql"
      + value               = "ON"
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.audit_log_events[0] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "audit_log_events" {
      + id                  = (known after apply)
      + name                = "audit_log_events"
      + resource_group_name = "banking-dev-rg"
      + server_name         = "banking-dev-mysql"
      + value               = "CONNECTION,DDL,DML,DCL"
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.log_queries_not_using_indexes will be created
  + resource "azurerm_mysql_flexible_server_configuration" "log_queries_not_using_indexes" {
      + id                  = (known after apply)
      + name                = "log_queries_not_using_indexes"
      + resource_group_name = "banking-dev-rg"
      + server_name         = "banking-dev-mysql"
      + value               = "ON"
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.long_query_time will be created
  + resource "azurerm_mysql_flexible_server_configuration" "long_query_time" {
      + id                  = (known after apply)
      + name                = "long_query_time"
      + resource_group_name = "banking-dev-rg"
      + server_name         = "banking-dev-mysql"
      + value               = "2"
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.require_ssl will be created
  + resource "azurerm_mysql_flexible_server_configuration" "require_ssl" {
      + id                  = (known after apply)
      + name                = "require_secure_transport"
      + resource_group_name = "banking-dev-rg"
      + server_name         = "banking-dev-mysql"
      + value               = "ON"
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.slow_query_log will be created
  + resource "azurerm_mysql_flexible_server_configuration" "slow_query_log" {
      + id                  = (known after apply)
      + name                = "slow_query_log"
      + resource_group_name = "banking-dev-rg"
      + server_name         = "banking-dev-mysql"
      + value               = "ON"
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.tls_version will be created
  + resource "azurerm_mysql_flexible_server_configuration" "tls_version" {
      + id                  = (known after apply)
      + name                = "tls_version"
      + resource_group_name = "banking-dev-rg"
      + server_name         = "banking-dev-mysql"
      + value               = "TLSv1.2,TLSv1.3"
    }

  # module.networking.azurerm_nat_gateway.main[0] will be created
  + resource "azurerm_nat_gateway" "main" {
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 10
      + location                = "centralus"
      + name                    = "banking-dev-nat-gateway"
      + resource_group_name     = "banking-dev-rg"
      + resource_guid           = (known after apply)
      + sku_name                = "Standard"
      + tags                    = (known after apply)
      + zones                   = [
          + "1",
        ]
    }

  # module.networking.azurerm_nat_gateway_public_ip_association.main[0] will be created
  + resource "azurerm_nat_gateway_public_ip_association" "main" {
      + id                   = (known after apply)
      + nat_gateway_id       = (known after apply)
      + public_ip_address_id = (known after apply)
    }

  # module.networking.azurerm_network_security_group.aks will be created
  + resource "azurerm_network_security_group" "aks" {
      + id                  = (known after apply)
      + location            = "centralus"
      + name                = "banking-dev-aks-nsg"
      + resource_group_name = "banking-dev-rg"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.networking.azurerm_network_security_group.database will be created
  + resource "azurerm_network_security_group" "database" {
      + id                  = (known after apply)
      + location            = "centralus"
      + name                = "banking-dev-db-nsg"
      + resource_group_name = "banking-dev-rg"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.networking.azurerm_network_security_rule.aks_http_inbound will be created
  + resource "azurerm_network_security_rule" "aks_http_inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowHTTPInbound"
      + network_security_group_name = "banking-dev-aks-nsg"
      + priority                    = 101
      + protocol                    = "Tcp"
      + resource_group_name         = "banking-dev-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.networking.azurerm_network_security_rule.aks_https_inbound will be created
  + resource "azurerm_network_security_rule" "aks_https_inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowHTTPSInbound"
      + network_security_group_name = "banking-dev-aks-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "banking-dev-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.networking.azurerm_network_security_rule.db_deny_all will be created
  + resource "azurerm_network_security_rule" "db_deny_all" {
      + access                      = "Deny"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAllInbound"
      + network_security_group_name = "banking-dev-db-nsg"
      + priority                    = 4096
      + protocol                    = "*"
      + resource_group_name         = "banking-dev-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.networking.azurerm_network_security_rule.db_mysql will be created
  + resource "azurerm_network_security_rule" "db_mysql" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "3306"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowMySQLFromAKS"
      + network_security_group_name = "banking-dev-db-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "banking-dev-rg"
      + source_address_prefix       = "10.0.0.0/22"
      + source_port_range           = "*"
    }

  # module.networking.azurerm_private_dns_zone.acr will be created
  + resource "azurerm_private_dns_zone" "acr" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurecr.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "banking-dev-rg"
      + tags                                                  = (known after apply)
    }

  # module.networking.azurerm_private_dns_zone.keyvault will be created
  + resource "azurerm_private_dns_zone" "keyvault" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "banking-dev-rg"
      + tags                                                  = (known after apply)
    }

  # module.networking.azurerm_private_dns_zone.mysql will be created
  + resource "azurerm_private_dns_zone" "mysql" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.mysql.database.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "banking-dev-rg"
      + tags                                                  = (known after apply)
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.acr will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "acr" {
      + id                    = (known after apply)
      + name                  = "acr-vnet-link"
      + private_dns_zone_name = "privatelink.azurecr.io"
      + registration_enabled  = false
      + resource_group_name   = "banking-dev-rg"
      + tags                  = (known after apply)
      + virtual_network_id    = (known after apply)
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.keyvault will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "keyvault" {
      + id                    = (known after apply)
      + name                  = "keyvault-vnet-link"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "banking-dev-rg"
      + tags                  = (known after apply)
      + virtual_network_id    = (known after apply)
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.mysql will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "mysql" {
      + id                    = (known after apply)
      + name                  = "mysql-vnet-link"
      + private_dns_zone_name = "privatelink.mysql.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "banking-dev-rg"
      + tags                  = (known after apply)
      + virtual_network_id    = (known after apply)
    }

  # module.networking.azurerm_public_ip.nat[0] will be created
  + resource "azurerm_public_ip" "nat" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "centralus"
      + name                    = "banking-dev-nat-pip"
      + resource_group_name     = "banking-dev-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = (known after apply)
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.networking.azurerm_subnet.aks will be created
  + resource "azurerm_subnet" "aks" {
      + address_prefixes                               = [
          + "10.0.0.0/22",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "banking-dev-aks-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "banking-dev-rg"
      + service_endpoints                              = [
          + "Microsoft.ContainerRegistry",
          + "Microsoft.KeyVault",
          + "Microsoft.Sql",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "banking-dev-vnet"
    }

  # module.networking.azurerm_subnet.application_gateway[0] will be created
  + resource "azurerm_subnet" "application_gateway" {
      + address_prefixes                               = [
          + "10.0.5.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "banking-dev-appgw-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "banking-dev-rg"
      + virtual_network_name                           = "banking-dev-vnet"
    }

  # module.networking.azurerm_subnet.database will be created
  + resource "azurerm_subnet" "database" {
      + address_prefixes                               = [
          + "10.0.4.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "banking-dev-db-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "banking-dev-rg"
      + service_endpoints                              = [
          + "Microsoft.Sql",
        ]
      + virtual_network_name                           = "banking-dev-vnet"

      + delegation {
          + name = "fs"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforMySQL/flexibleServers"
            }
        }
    }

  # module.networking.azurerm_subnet.private_endpoints will be created
  + resource "azurerm_subnet" "private_endpoints" {
      + address_prefixes                               = [
          + "10.0.6.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "banking-dev-pe-subnet"
      + private_endpoint_network_policies              = "Disabled"
      + private_e

... (truncated, see workflow logs for full output)
```

</details>

---
*Triggered by @boateng0303 | Workflow: `Terraform PR Validation` | [View Logs](https://github.com/boateng0303/secure-bankapp-devsecops/actions/runs/20649217122)*